# Pandas Concatenate
Concatenate is an operation that you do when you want to join two or more
DataFrames

In [8]:
import pandas as pd
pakistan_weather=pd.DataFrame({
    'city':['Peshawar','Karachi','Lahore'],
    'Average temperature':[23,26,32],
    'Average humidity':[64,70,53]
})
pakistan_weather

       city  Average temperature  Average humidity
0  Peshawar                   23                64
1   Karachi                   26                70
2    Lahore                   32                53

In [6]:
India_weather=pd.DataFrame({
    'city':['Mumbai','delhi','banglore'],
    'Average temperature':[32,45,30],
    'Average humidity':[80,60,78]
})
India_weather

       city  Average temperature  Average humidity
0    Mumbai                   32                80
1     delhi                   45                60
2  banglore                   30                78

In [18]:
df = pd.concat([pakistan_weather,India_weather])
df # the problem here is, is an index numbers so we have to ignore it by writing:->

       city  Average temperature  Average humidity
0  Peshawar                   23                64
1   Karachi                   26                70
2    Lahore                   32                53
0    Mumbai                   32                80
1     delhi                   45                60
2  banglore                   30                78

In [10]:
df = pd.concat([pakistan_weather,India_weather],ignore_index=True)
df

       city  Average temperature  Average humidity
0  Peshawar                   23                64
1   Karachi                   26                70
2    Lahore                   32                53
3    Mumbai                   32                80
4     delhi                   45                60
5  banglore                   30                78

In [11]:
# now we also want to mention Country name as an index so for that:
df = pd.concat([pakistan_weather,India_weather], keys=['pakistan','india'])
df

                city  Average temperature  Average humidity
pakistan 0  Peshawar                   23                64
         1   Karachi                   26                70
         2    Lahore                   32                53
india    0    Mumbai                   32                80
         1     delhi                   45                60
         2  banglore                   30                78

In [12]:
# to retreive one location data like pakistan
df.loc['pakistan'] # loc means Location

       city  Average temperature  Average humidity
0  Peshawar                   23                64
1   Karachi                   26                70
2    Lahore                   32                53

Uptil now what we do is concat 2 different city data and merge them row wise but
# what if we want to merge some data column wise, so for that we can do as:

In [13]:
temperture_df=pd.DataFrame({
     'city':['Mumbai','delhi','banglore'],
    'Average temperature':[32,45,30],
})
temperture_df

       city  Average temperature
0    Mumbai                   32
1     delhi                   45
2  banglore                   30

In [24]:
windspeed_df=pd.DataFrame({
     'city':['Mumbai','delhi','banglore'],
    'Average Windspeed':[7,5,9],
})
windspeed_df

       city  Average Windspeed
0    Mumbai                  7
1     delhi                  5
2  banglore                  9

In [25]:
df = pd.concat([temperture_df,windspeed_df],axis=1)
df

       city  Average temperature      city  Average Windspeed
0    Mumbai                   32    Mumbai                  7
1     delhi                   45     delhi                  5
2  banglore                   30  banglore                  9

In [26]:
# it has been done now colum wise as both the DF contains same data for cities but
# what if we have cities at different positions or have different cities so for that

In [27]:
temperture_df=pd.DataFrame({
     'city':['Mumbai','delhi','banglore'],
    'Average temperature':[32,45,30],
})
temperture_df

       city  Average temperature
0    Mumbai                   32
1     delhi                   45
2  banglore                   30

In [28]:
windspeed_df=pd.DataFrame({
     'city':['delhi','Mumbai'],
    'Average Windspeed':[7,5],
})
windspeed_df

     city  Average Windspeed
0   delhi                  7
1  Mumbai                  5

In [29]:
df = pd.concat([temperture_df,windspeed_df],axis=1)
df

       city  Average temperature    city  Average Windspeed
0    Mumbai                   32   delhi                7.0
1     delhi                   45  Mumbai                5.0
2  banglore                   30     NaN                NaN

In [30]:
# so the data provided have some mistakes in order and the result have exception because we want cities to be aligned in front of eachother so for that:
# we just have to pass index
temperture_df=pd.DataFrame({
     'city':['Mumbai','delhi','banglore'],
    'Average temperature':[32,45,30],
},index=[0,1,2])
temperture_df

       city  Average temperature
0    Mumbai                   32
1     delhi                   45
2  banglore                   30

In [31]:
windspeed_df=pd.DataFrame({
     'city':['delhi','Mumbai'],
    'Average Windspeed':[7,5],
},index=[1,0])
windspeed_df

     city  Average Windspeed
1   delhi                  7
0  Mumbai                  5

In [32]:
# now we have a correct index for both the DF
df = pd.concat([temperture_df,windspeed_df],axis=1)
df

       city  Average temperature    city  Average Windspeed
0    Mumbai                   32  Mumbai                5.0
1     delhi                   45   delhi                7.0
2  banglore                   30     NaN                NaN

In [33]:
# now the exceptions are handled and the data is corrected

# joining data with a Series

In [36]:
temperture_df

       city  Average temperature
0    Mumbai                   32
1     delhi                   45
2  banglore                   30

In [37]:
s = pd.Series(['Humid','Rain','Dry'],name="Event")
s

0    Humid
1     Rain
2      Dry
Name: Event, dtype: object

In [38]:
df= pd.concat([temperture_df,s],axis=1)
df

       city  Average temperature  Event
0    Mumbai                   32  Humid
1     delhi                   45   Rain
2  banglore                   30    Dry